Repository: hochschule-darmstadt/MetaAutoML
Catalog: frontend/src/Server/BlazorBoilerplate.Server/Archive/Localization/*.po
Languages: de_de

source: CreateApiResourcePermission
de_de: Erstellen einer neuen API-Ressource

source: CreateClientPermission
de_de: Erstellen eines neuen Clients

source: CreateRolePermission
de_de: Erstellen einer neuen Rolle

source: CreateUserPermission
de_de: Erstellen eines neuen Benutzers

source: DeleteApiResourcePermission
de_de: Lösche alle API-Ressources

source: DeleteClientPermission
de_de: Lösche alle Clients

source: DeleteRolePermission
de_de: Lösche alle Rollen

source: DeleteUserPermission
de_de: Lösche alle Benutzer

source: ReadApiResourcePermission
de_de: Lese API Ressource-Daten

source: ReadClientPermission
de_de: Lese Clients-Daten

source: ReadRolePermission
de_de: Lese Rollen-Daten Berechtigungen etc.")

source: ReadUserPermission
de_de: Lese Benutzer-Daten (Namen, Emails, Telefonnummern, etc.)

source: UpdateApiResourcePermission
de_de: Bearbeite existierende API-Ressourcen

source: UpdateClientPermission
de_de: Bearbeite existierende Clients

source: UpdateRolePermission
de_de: Bearbeite existierende Rollen

source: UpdateUserPermission
de_de: Bearbeite existierende Benutzer

source: CreateIdentityResourcePermission
de_de: Erstellen einer neuen Identity-Ressource

source: ReadIdentityResourcePermission
de_de: Lese Identity-Ressource-Daten

source: UpdateIdentityResourcePermission
de_de: Bearbeite existierende Identity-Ressourcen

source: DeleteIdentityResourcePermission
de_de: Lösche alle Identity-Ressources

source: Delete
de_de: Löschen

source: Cancel
de_de: Abbrechen

source: Users
de_de: Benutzer

source: Roles
de_de: Rollen

source: ApiResources
de_de: OpenID API Ressourcen

source: IdentityResources
de_de: OpenID Identity Ressourcen

source: Loading
de_de: Ladevorgang läuft...

source: New Client
de_de: Neuer Client

source: New User
de_de: Neuer Benutzer

source: New Role
de_de: Neue Rolle

source: New API Resource
de_de: Neue API Ressource

source: New Identity Resource
de_de: Neue Identity Ressource

source: {0} users fetched
de_de: {0} Benutzer abgerufen

source: Operation Successful
de_de: Vorgang erfolgreich

source: Operation Failed
de_de: Vorgang fehlgeschlagen

source: {0} roles fetched
de_de: {0} Rollen abgerufen

source: {0} clients fetched
de_de: {0} Clients abgerufen

source: {0} identity resources fetched
de_de: {0} Identity-Ressourcen abgerufen

source: {0} API resources fetched
de_de: {0} API-Ressourcen abgerufen

source: Create
de_de: Erstellen

source: Update
de_de: Aktualsieren

source: Edit {0}
de_de: Bearbeiten '{0}'

source: Permissions list fetched
de_de: Berechtigungsliste abgerufen

source: Role {0} created
de_de: Rolle {0} erstellt

source: Role {0} already exists
de_de: Rolle {0} existiert bereits

source: The role {0} doesn't exist
de_de: Die Rolle {0} existiert nicht.

source: Role {0} deleted
de_de: Rolle {0} gelöscht

source: RoleInUseWarning
de_de: Diese Rolle {0} wird noch durch einen Benutzer verwendet. Sie kann daher nicht gelöscht werden.

source: Client {0} created
de_de: Client {0} erstellt

source: The client {0} doesn't exist
de_de: Der Client {0} existiert nicht.

source: Client {0} updated
de_de: Client {0} aktualisiert

source: Client {0} deleted
de_de: Client {0} gelöscht

source: Role {0} updated
de_de: Rolle {0} aktualisiert

source: Identity Resource {0} created
de_de: Identity Ressource {0} erstellt

source: Identity Resource {0} updated
de_de: Identity Ressource {0} aktualisiert

source: Identity Resource {0} deleted
de_de: Identity Ressource {0} gelöscht

source: API Resource {0} created
de_de: API Ressource {0} erstellt

source: API Resource {0} updated
de_de: API Ressource {0} aktualisiert

source: API Resource {0} deleted
de_de: API Ressource {0} gelöscht

source: The API resource {0} doesn't exist
de_de: Die API-Ressource {0} existiert nicht.

source: The Identity resource {0} doesn't exist
de_de: Die Identity-Ressource {0} existiert nicht.

source: UserName
de_de: Benutzername

source: Sign in with
de_de: Anmelden mit

source: Sign up
de_de: Registrieren

source: Keep me logged in
de_de: Eingeloggt bleiben

source: Forgot your password?
de_de: Passwort vergessen?

source: Submit
de_de: Absenden

source: LoginFailed
de_de: Login-Versuch fehlgeschlagen

source: ResetPasswordFailed
de_de: Versuch Passwort zurückzusetzen fehlgeschlagen

source: ForgotPasswordEmailSent
de_de: Passwort-Vergessen Email gesendet

source: Confirm Email
de_de: Bestätige Email

source: Send Confirmation
de_de: Bestätigung senden

source: EmailVerificationFailed
de_de: Email Verifizierung fehlgeschlagen

source: EmailVerificationSuccessful
de_de: Email Verifizierung erfolgreich

source: ResetPasswordSuccessful
de_de: Passwort erfolgreich zurückgesetzt

source: Password Reset
de_de: Passwort zurücksetzen

source: Password Confirmation
de_de: Passwort bestätigen

source: Reset Password
de_de: Passwort zurücksetzen

source: UserCreationFailed
de_de: Benutzer erstellen fehlgeschlagen

source: UserCreationSuccessful
de_de: Benutzer erfolgreich erstellt

source: Registration
de_de: Registrierung

source: PasswordConfirmationFailed
de_de: Das Passwort und das Bestätigungspasswort stimmen nicht überein.

source: ConfirmPassword
de_de: Bestätige Passwort

source: ErrorInvalidLength
de_de: {0} muss mindestens {2} und darf maximal {1} Zeichen lang sein.

source: SpacesNotPermitted
de_de: Leerzeichen sind nicht gestattet

source: Role
de_de: Rolle

source: AlreadyRegistered
de_de: Bereits registriert?

source: Register
de_de: Registrieren

source: InvalidData
de_de: Eingegebene Daten sind nicht gültig

source: The user {0} doesn't exist
de_de: Der Benutzer {0} existiert nicht.

source: The user doesn't exist
de_de: Der Benutzer existiert nicht.

source: User {0} created
de_de: Benutzer {0} erstellt

source: Confirm Delete
de_de: Bestätige Löschen

source: Tenants
de_de: Mandanten

source: Tenant
de_de: Mandant

source: MultiTenancy
de_de: Mehrmandantenfähigkeit

source: {0} tenants fetched
de_de: {0} Mandanten abgerufen

source: Tenant {0} created
de_de: Mandant {0} erstellt

source: The tenant {0} doesn't exist
de_de: Der Mandant {0} existiert nicht.

source: Tenant {0} updated
de_de: Mandant {0} aktualisiert

source: Tenant {0} deleted
de_de: Mandant {0} gelöscht

source: Role {0} cannot be deleted
de_de: Rolle{0} kann nicht gelöscht werden

source: Tenant {0} cannot be deleted
de_de: Mandant {0} kann nicht gelöscht werden

source: Role {0} cannot be edited
de_de: Rolle {0} kann nicht bearbeitet werden

source: AuthenticationRequired
de_de: Authentifizierung erforderlich

source: LoginRequired
de_de: Bitte zuerst einloggen

source: Operation not allowed
de_de: Vorgang nicht erlaubt

source: NotAuthorizedTo
de_de: Sie sind nicht authorisiert diesen Vorgang durchzuführen.

source: PleaseWait
de_de: Bitte warten...

source: Settings
de_de: Einstellungen

source: EmailSettings
de_de: Email Einstellungen

source: OutgoingEmail
de_de: Ausgehende Email

source: IncomingEmail
de_de: Eingehende Email

source: PopServer
de_de: POP3 Server

source: Save
de_de: Speichern

source: SenderEmail
de_de: Absender E-Mail

source: SenderName
de_de: Absender Name

source: MainSettings
de_de: Einstellungen

# TrainingTimeline
source: started
de_de: Experiment gestartet

# TrainingTimeline
source: preprocessing
de_de: Vorverarbeitung

# TrainingTimeline
source: running
de_de: Ausführung der AutoMLs

# TrainingTimeline
source: stopped
de_de: Experiment beendet

# TrainingTimeline
source: strategy_action
de_de: Strategie-Aktion

# TrainingTimeline
source: automl_run_finished
de_de: AutoML beendet

# TrainingTimeline
source: data_preparation.ignore_redundant_features
de_de: Redundante Features ignoriert

# TrainingTimeline
source: data_preparation.ignore_redundant_samples
de_de: Redundante Samples ignoriert

# TrainingTimeline
source: data_preparation.finish_preprocessing
de_de: Datenvorbereitung abgeschlossen

# TrainingTimeline
source: automl_run_finished_{0}
de_de: AutoML abgeschlossen: {0}

source: Required
de_de: Erforderlich

source: Email
de_de: Email Adresse

source: Password
de_de: Passwort

source: My datasets {0}
de_de: Meine Datensets: {0}

source: My trainings {0}
de_de: Meine Trainings: {0}

source: My models {0}
de_de: Meine Modele: {0}

source: Executing trainings {0}
de_de: Laufende Trainings: {0}

source: Overview
de_de: Übersicht

source: Recent datasets
de_de: Aktuelle Datasets

source: Add
de_de: Hinzufügen

source: More
de_de: Mehr

source: Type
de_de: Typ

source: Size
de_de: Größe

source: Date
de_de: Datum

source: Time
de_de: Uhrzeit

source: tabular
de_de: Tabellarisch

source: image
de_de: Bilder

source: time series longitudinal
de_de: Zeitreihen longitudinal

source: time series
de_de: Zeitreihen

source: Select the data format of your dataset
de_de: Datenset Datentyp auswählen

source: Select Dataset
de_de: Datenset Auswählen

source: Dataset Name
de_de: Datenset Name

source: Close
de_de: Schließen

source: Upload
de_de: Hochladen

source: Recent trainings
de_de: Aktuelle Trainings

source: Start datetime
de_de: Start Datum

source: Dataset
de_de: Datenset

source: Datasets
de_de: Datensets

source: Search for name or type
de_de: Nach Name oder Typ suchen

source: All datasets
de_de: Alle Datensets

source: Rows per page
de_de: Zeilen pro Seite

source: Dataset type: {0}
de_de: Datenset Typ: {0}

source: Date: {0}
de_de: Datum: {0}

source: File Size: {0}
de_de: Dateiengröße: {0}

source: Number of rows: {0}
de_de: Reihenanzahl: {0}

source: Number of columns: {0}
de_de: Spaltenanzahl: {0}

source: New Training
de_de: Neues Training

source: Dataset {0}
de_de: Datenset {0}

source: Library
de_de: Bibliothek

source: Test score
de_de: Test Ergebnis

source: Prediction time per sample
de_de: Zeit pro Vorhersage

source: Total training time
de_de: Gesamt Trainingszeit

source: Top 3 models
de_de: Top 3 Modelle

source: Analysis
de_de: Analyse

source: Preview
de_de: Vorschau

source: Configure
de_de: Konfigurieren

source: Dataset can not be read successfully, change file configuration.
de_de: Datenset konnte nicht erfolgreich gelesen werden, bitte die Datei Konfiguration ändern.

source: Use header
de_de: Header verwenden

source: Start row
de_de: Start Reihe

source: Column seperator
de_de: Spalten separator

source: Escape character
de_de: Escapezeichen

source: Decimal character
de_de: Dezimalzeichen

source: Train
de_de: Trainieren

source: Dataset preparation
de_de: Datensetvorbereitung

source: Configuration
de_de: Konfiguration

source: Machine Learning task
de_de: ML Task

source: AutoML solutions
de_de: AutoML Systeme

source: Machine Learning libraries
de_de: Machine Learning Bibliothek

source: Enabled strategies
de_de: Aktivierte Strategien

source: Runtime
de_de: Laufzeit

source: Previous
de_de: Zurück

source: Finish
de_de: Starten

source: Next
de_de: Nächste

source: AutoML solution
de_de: AutoML System

source: completed
de_de: Erfolgreich

source: ended
de_de: Beendet

source: download
de_de: Herunterladen

source: Add Live Dataset
de_de: Live Dataset hinzufügen

source: busy
de_de: Läuft

source: failed
de_de: Fehlgeschlagen

source: Search by AutoML solution, Status, Model or Library
de_de: Nach AutoML System, Status, Model oder Bibliothek suchen

source: Dataset:
de_de: Datenset:

source: Total training time: {0}
de_de: Gesamte Trainingszeit: {0} s

source: AutoML solution: {0}
de_de: AutoML System: {0}

source: Machine Learning library: {0}
de_de: Machine Learning Bibliothek: {0}

source: Metric score: {0}
de_de: Metric Ergebnis: {0}

source: Prediction time per sample: {0}
de_de: Zeit pro Vorhersage: {0} ms

source: Predict online
de_de: Online vorhersagen

source: Upload File
de_de: Datei hochladen

source: Download result CSV
de_de: CSV Ergebnis herunterladen

source: Download Machine Learning pipeline
de_de: Machine Learning Pipeline herunterladen

source: Download model
de_de: Model herunterladen

source: Dataset: {0}
de_de: Datenset: {0}

source: Selected Machine learning libraries
de_de: Ausgewählte Machine learning Bibliothek

source: Selected AutoMl solutions
de_de: Ausgewählte AutoML Systeme

source: Dataset configuration
de_de: Datenset Konfiguration

source: Runtime constrains
de_de: Laufzeitbeschränkung

source: Correlation Matrix
de_de: Korrelationsmatrix

source: Correlation analysis
de_de: Korrelationsanalyse

source: Column analysis
de_de: Säulenanalyse

source: Models
de_de: Modelle

source: Past training
de_de: Vergangene Trainings

source: Search for status, task or dataset type
de_de: Nach Status, Start Datum oder Datenset Typ suchen

source: TwoFactorAuthentication
de_de: Zwei Faktor Authentifizierung

source: Dataset not redable
de_de: Datenset konnte nicht gelessen werden! Wenn das Datenset gerade hochgeladen wurde muss noch etwas gewartet werden bevor dieses bereitsteht. Ansonsten stimmt die Datenset Konfiguration nicht, diese kann durch die Vorschau Konfiguration neu konfiguriert werden

source: Model: {0}
de_de: Modell: {0}

source: Please enter a dataset name first!
de_de: Datenset Namen eingeben!

source: Please select a dataset type first!
de_de: Datenset Typ auswählen!

source: Please select a file first!
de_de: Datei auswählen!

source: Preparing upload...
de_de: Upload wird vorbereitet...

source: Uploading {0} {1}
de_de: Hochladen {0} {1}%

source: Comma ","
de_de: Komma ","

source: Semicolon ";"
de_de: Semikolon ";"

source: Space
de_de: Leerzeichen

source: Tab
de_de: Tabulator

source: tabular classification
de_de: Tabellarische Klassifikation

source: tabular regression
de_de: Tabellarische Regression

source: time series forecasting
de_de: Zeitreihenvorhersage

source: image classification
de_de: Bild Klassifikation

source: text classification
de_de: Text Klassifikation

source: tabular clustering
de_de: Tabellarisches Clustering

source: File configuration can not be saved, incompatible delimiter
de_de: Datei Konfiguration konnte nicht gespeichert werden, Spaltenseparator inkompatibel.

source: Could not read dataset successfully, change configuration
de_de: Datenset konnte nicht gelessen werden, ändern Sie die Konfiguration.

source: Change Password
de_de: Passwort ändern

source: EnableAuthenticatorInstructions
de_de: <p>Laden Sie eine Zwei-Faktor-Authentifizierungs-App wie Microsoft Authenticator oder Google Authenticator herunter.</p><p>Sannen Sie den QR Code oder den Schlüssel <kbd>{0}</kbd> in Ihrer Zwei-Faktor-Authentifizierungs-App. Leerzeichen sowie Groß- und Kleinschreibung sind nicht relevant.</p><img src="{1}" style="width: 200px" /><p>Sobald Sie den QR Code gescannt oder den obigen Schlüssel eingegeben haben, bietet Ihnen die App zur Zwei-Faktor-Authentifizierung folgende Informationen mit einem einmaligen Code. Geben Sie den Code in das Bestätigungsfeld unten ein und bestätigen Sie.</p>

source: ENTER URL
de_de: URL eingeben

source: LastName
de_de: Nachname

source: FirstName
de_de: Vorname

source: VerifyCode
de_de: Code überprüfen

source: ResetAuthenticator
de_de: Authentifikator zurücksetzen

source: Search by name, status, lib or AutoML system
de_de: Nach Name, Status, Bibliothek oder AutoML System suchen

source: CookieName
de_de: Name

source: CookieLifecycle
de_de: Gültigkeit

source: CookieDescription
de_de: Beschreibung

source: AntiforgeryCookieName
de_de: .AspNetCore.Antiforgery

source: AntiforgeryCookieLifecycle
de_de: Sitzung

source: AntiforgeryCookieDescription
de_de: Dieses Cookie speichert den Anti Forgery Token ab, wird zum Schutz vor Cross-Site-Request-Forgery-Attack verwendet.

source: CultureCookieName
de_de: .AspNetCore.Culture

source: CultureCookieLifecycle
de_de: 1 Monat

source: CultureCookieDescription
de_de: Dieses Cookie speichert die Sprachauswahl, wird zur Darstellung der richtigen Sprache verwendet.

source: CookieConsentCookieName
de_de: .AspNet.CookieConsent

source: CookieConsentCookieLifecycle
de_de: 6 Monate

source: CookieConsentCookieDescription
de_de: Dieses Cookie speichert die vom User erlaubten Cookies ab.

source: IdentityApplicationCookieName
de_de: .AspNetCore.Identity.Application

source: IdentityApplicationCookieLifecycle
de_de: Sitzung

source: IdentityApplicationCookieDescription
de_de: Dieses Cookie ermöglicht die Cookie basierte Nutzerautorisierung, wird für das Nutzermanagement verwendet.

source: IdsrvSessionCookieName
de_de: idsrv.session

source: IdsrvSessionCookieLifecycle
de_de: Sitzung

source: IdsrvSessionCookieDescription
de_de: Dieses Cookie speichert die aktuelle Sitzungs id, wird für das Nutzermanagement verwendet.

source: FolderStructureNotCorrectErrorMessage
de_de: Die Ordnerstruktur der Zip-Datei entspricht nicht den Anforderungen.

source: FileTypeNotSupportedErrorMessage
de_de: Der Dateityp entspricht nicht den Anforderungen.

source: EncodingNotSupportedErrorMessage
de_de: Das Encoding entspricht nicht den Anforderungen.

source: AffinityCookieName
de_de: affinity

source: AffinityCookieLifecycle
de_de: 4 Stunden

source: AffinityCookieDescription
de_de: Dieses Cookie speichert die aktuelle Sticky Sitzungs id, wird für das korrekte Routing verwendet.

source: Encoding
de_de: Codierung

source: boolean
de_de: Boolescher Wert

source: categorical
de_de: Kategorien

source: list
de_de: Liste

source: single_value
de_de: Single

source: ignore
de_de: Ignorieren

source: none
de_de: Keine

source: Datatype
de_de: Datentyp

source: Datatype analysis incompatible with current dataset configuration, save current configuration to start new analysis
de_de: Datentypenanalyse ist nicht mit der aktuellen Konfiguration kompatibel. Durch das Speichern der aktuellen Konfiguration wird eine neue Analyse gestartet.

source: Roles analysis incompatible with current dataset configuration, save current configuration to start new analysis
de_de: Rollenanalyse ist nicht mit der aktuellen Konfiguration kompatibel. Durch das Speichern der aktuellen Konfiguration wird eine neue Analyse gestartet.

source: Thousand seperator
de_de: Tausendertrennzeichen

source: Column {0} could not be casted to datetime
de_de: Spalte {0} konnte nicht zum Datentypen Datetype konvertiert werden.

source: Datetime columns could not be converted to new datetime format
de_de: Datetime Spalten konnten nicht in das neue Datetime format konvertiert werden.

source: File configuration can not be saved, datetime columns could not be converted to new datetime format
de_de: Datenset-konfiguration konnte nicht gespeichert werden, Datetime Spalten konnten nicht in das neue Datetime Format konvertiert werden.

source: Save Schema
de_de: Schema speichern

source: More than one target selected
de_de: Mehr als ein Target wurde ausgewählt.

source: No target selected
de_de: Kein Target wurde ausgewählt.

source: No task selected
de_de: Kein Machine Learning Task wurde ausgewählt.

source: No index selected
de_de: Keine Index Spalte wurde gesetzt.

source: No datetime index selected
de_de: Keine oder mehrere Index Spalte mit Datentyp Datetime wurde gesetzt. Es darf nur eine Index Spalte mit Datentyp Datetime im Datensatz existieren.

source: Emissions kg/CO2-eq
de_de: Emissionen in kg/CO2-eq

source: Emissions: {0} kg/CO2-eq
de_de: Emissionen: {0} kg/CO2-eq

source: aborted
de_de: Abgebrochen
