[
    {
        "PanelHeadline": "Introduction",
        "Sections": [
            {
                "Headline": "Dataset upload",
                "Text": "Click on UPLOAD to upload a new dataset to OMA-ML from your disk or from the internet. You can upload tabular data, text, images or time series. If you have selected a dataset for the upload you can change the filename in the textfield. By default, the previous filename is used.",
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/UploadDataset.gif",
                "Anchor": "datasetUpload"
            },
            {
                "Headline": "Preprocessing",
                "Text": "Preprocessing is a crucial part of data preparation that aims to clean and organize raw data into a suitable format for the training. In this step you can chose column seperator, encoding, datetime format, escape character, decimal character and thousand seperator if necessary. You can also manually chose the datatype and role of the individual columns.",
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Preprocessing.gif",
                "Anchor": "preprocessing"
            },
            {
                "Headline": "Model selection",
                "Text": "A ML model is a computational algorithm that learns patterns and relationships within the training dataset in order to make predictions. During the Model selection process the build-in AutoML solutions will use different approaches to evaluate different ML models to determine which ML model is the most suitable for a given training dataset.",
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/ModelSelection.gif",
                "Anchor": "modelselection"
            },
            {
                "Headline": "Training",
                "Text": "In this step, a machine learning task must first be selected. Initially, all ML libraries that are supported for the selected ML task are selected. But you can also select the ML libraries for which ML models shall be generated. The AutoML solutions generate ML models for certain ML libraries. During training, various AutoML solutions are executed in parallel.",
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Training.gif",
                "Anchor": "training"
            },
            {
                "Headline": "Deployment",
                "Text": "The settings made in the training configuration are now applied and the training is started.",
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Deployment.gif",
                "Anchor": "deployment"
            },
            {
                "Headline": "Prediction",
                "Text": "On the Model page, you can inspect and use the trained ML model. You may use the model for predicting new cases within the OMA-ML platform without having to install anything (panel center left). Alternatively, you may download the ML model within a pipeline and include it into a custom Python application (panel center right).  There are various ways of getting additional information about the model: an overview (top panel), detailed graphical analyses using Explainable AI (panel bottom left), the configuration that lead to the model (panel bottom center), and detail output of the AutoML solution (panel bottom right). You also may download a pipeline as Python source code including the generated ML model and pre-processing functions and include this code into a custom Python application.",
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Prediction.gif",
                "Anchor": "prediction"
            }
        ]
    },
    {
        "PanelHeadline": "Pages",
        "Sections": [
            {
                "Headline": "Home",
                "Text": "When you open the website, you first get to the home page. This page already provides an initial overview of previously uploaded datasets and completed trainings.",
                "Subsections": [
                    {
                        "SubHeadline": "Overview:",
                        "SubText": "In the Overview tile, you will find a list of the datasets uploaded so far, the trainings and models."
                    },
                    {
                        "SubHeadline": "Recent Datasets:",
                        "SubText": "In this area it is possible to upload a new dataset using the Upload button. You can also use the More button to navigate to the dataset page. The table lists the datasets uploaded so far. If you click on the name of a dataset, you will be directed to the detailed view of the dataset."
                    },
                    {
                        "SubHeadline": "Recent trainings:",
                        "SubText": "The Details button leads you to the training page. Below this button is a table which displays the most recently started trainings."
                    }
                ],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/UploadDataset.gif",
                "Anchor": "home"
            },
            {
                "Headline": "Datasets",
                "Text": "All datasets that have been uploaded so far are listed on the datasets page. There is also the option to upload further datasets.",
                "Subsections": [],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Preprocessing.gif",
                "Anchor": "datasets"
            },
            {
                "Headline": "Dataset detail",
                "Text": "On this detail page, the uploaded data set can be analyzed and configured more in detail.",
                "Subsections": [
                    {
                        "SubHeadline": "Overview:",
                        "SubText": "Here you will find information about the dataset, such as name, dataset type, date of upload, file size and the number of rows and columns."
                    },
                    {
                        "SubHeadline": "New Training::",
                        "SubText": "In the New Training tile, a new training session can be started by clicking the button."
                    },
                    {
                        "SubHeadline": "Preview:",
                        "SubText": "The contents of the dataset can be seen in the preview. At the top right there is a button labeled Configure which can be clicked to configure the data set in more detail."
                    },
                    {
                        "SubHeadline": "Analysis:",
                        "SubText": "Clicking on the More button or on the image under Analysis takes you to an analysis page that examines the data set in detail and contains diagrams."
                    },
                    {
                        "SubHeadline": "Top 3 models:",
                        "SubText": "Under Top 3 models you will find the top 3 models that have been trained so far."
                    }
                ],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/DatasetDetail.gif",
                "Anchor": "datasetdetail"
            },
            {
                "Headline": "Dataset configure",
                "Text": "Various adjustments can be made to the dataset in the Dataset Configuration. Firstly, the use of the header can be deactivated. In addition, rows can be ignored by changing the number in the Start row field. The column separator can be set as a semicolon, space or tab in addition to a comma. The encoding is UTF-8 by default and can also be latin-1, UTF-16 or UTF-32. The datetime format can be adjusted in the corresponding text field. In addition, the escape character, decimal character and thousand separator can be customized. The data type and role for the individual columns can be set in the table directly below the header. The following role options are available: None, Target, Ignore and Index.",
                "Subsections": [],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Preprocessing.gif",
                "Anchor": "datasetconfigure"
            },
            {
                "Headline": "Trainings",
                "Text": "The training page lists all training that have been started so far. If you click on the start time of a training, you will be taken to the details page of this training.",
                "Subsections": [],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Trainings.gif",
                "Anchor": "trainings"
            },
            {
                "Headline": "Train - Dataset preparation",
                "Text": "ML training is the process of condensing implicit information in a dataset into a generated ML model. This is the first step of the training wizard. Here you can modify pre-configured datatypes of columns in tabular datasets. You can also assign roles, in particular whether a column is an ID (and hence be ignored for training) or is the training target.",
                "Subsections": [],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Train-DatasetPreparation.gif",
                "Anchor": "traindatasetpreparation"
            },
            {
                "Headline": "Train - Configuration",
                "Text": " This is the second step of the training wizard. Here you can select the ML task, i.e., what the ML model shall predict, e.g., classes (classification) or values (regression). Additionaly you can choose which column in a tabular dataset is to be predicted by the ML model in the dropdown called Target. Specify the maximum runtime in minutes OMA-ML shall use for training. Longer runtimes tend to produce better models; shorter runtimes are more energy-efficient. Under the Details dropdown, there are further setting options that can be made, but are not absolutely necessary as default values are already set.",
                "Subsections": [
                    {
                        "SubHeadline": "ML libraries",
                        "SubText": "Select or deselect ML libraries for which ML models shall be generated. Initially, all ML libraries that are supported for the selected ML task are selected (indiated by a tick). When changing selections, corresponding AutoML solutions will be adapted automatically."
                    },
                    {
                        "SubHeadline": "AutoML solutions",
                        "SubText": "AutoML solutions generate ML models for certain ML libraries. Initially, all AutoML solutions are selected that are supported for the selected ML libraries. When changing selections, corresponding ML libraries will be adapted automatically."
                    },
                    {
                        "SubHeadline": "Enabled strategies",
                        "SubText": " Training strategies are intelligent helpers that perform best practices in data science for you automatically. Select strategies that you want to enable for this training."
                    }
                ],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Train-Configuration.gif",
                "Anchor": "trainconfiguration"
            },
            {
                "Headline": "Training Detail",
                "Text": "This page shows the leaderboard for an ML training. During training, various AutoML solutions are executed in parallel. This is indicated by a spinning wheel. Whenever an AutoML solution has terminated, the result is displayed. The top performing models are shown first in the leaderboard. Clicking on the light bulb in the Model column takes you to the respective model detail view.",
                "Subsections": [],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/TrainingDetail.gif",
                "Anchor": "trainingdetail"
            },
            {
                "Headline": "Models",
                "Text": "This page shows all models that have been trained for this dataset so far, potentially in several training sessions.",
                "Subsections": [],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/Models.gif",
                "Anchor": "models"
            },
            {
                "Headline": "Model Detail",
                "Text": " An ML model is the result of ML training and condenses information inherent in the training dataset. It can be used for making predictions on new cases. On the Model page, you can inspect and use the trained ML model.",
                "Subsections": [
                    {
                        "SubHeadline": "Overview:",
                        "SubText": "The overview contains general information about the model, such as the dataset, when the training took place, the status of the training and the training time. The AutoML solutions, ML library and the model are also listed. Clicking on the date next to Training takes you to the corresponding training page. The predction time and emissions are also shown."
                    },
                    {
                        "SubHeadline": "Predict online:",
                        "SubText": "You may use the model for predicting new cases within the OM-ML platform without having to install anything. Simply upload a file with the new cases with the Add Live Dataset button. You can also preview or download the result table with the button View predictions."
                    },
                    {
                        "SubHeadline": "Download ML model pipeline:",
                        "SubText": "Here you may download a pipeline as Python source code including the generated ML model and pre-processing functions. You may include this code into a custom Python application."
                    },
                    {
                        "SubHeadline": "Analysis:",
                        "SubText": "Here you get various detailed graphical analyses using Explainable AI (XAI)."
                    },
                    {
                        "SubHeadline": "Configuration:",
                        "SubText": "Here you can inspect the original configuration that lead to the ML model."
                    },
                    {
                        "SubHeadline": "Details:",
                        "SubText": "Here you can inspect the detail output of the AutoML solution that has been used for training this ML model."
                    }
                ],
                "GIF": "_content/BlazorBoilerplate.Theme.MudBlazor/images/ModelDetail.gif",
                "Anchor": "modeldetail"
            }
        ]
    }
]
